package Homework7v2;

public class Main {

	public static void main(String[] args) { 

		Кермо керм = new Кермо (40.5 , " резина " ) ;
		Колесо кол = new Колесо (195 , " H " ) ;
		Кузов кузо = new Кузов ( " сірий " ) ;
		Машина маш = new Машина ( 140 , 5 , кол , керм , кузо ) ;
		
		System.out.println( маш ) ;
		
		маш.setПотужністьдвигуна(250);
		маш.setКількістьмісць(2);
		керм.setДіаметр( керм.halfКермодіаметр()) ;
		керм.setМатеріал( " шкіра " ) ;
		кол.setРозмір(кол.розмір(20)) ;
		кол.setТип(" W " ) ;
		кузо.setКолір( " чоний " ) ;
		
		System.out.println( маш ) ;
		
		
		
		
		
		
		
		
		
				
		
		
	}
}