package Homework7v2;

public class Машина {
	
	private int потужністьдвигуна ;
	private int кількістьмісць ;
	private Колесо колесо ;
	private Кермо кермо ;
	private Кузов кузов ;
	
	public Машина(int потужністьдвигуна, int кількістьмісць, Колесо колесо, Кермо кермо, Кузов кузов) {
		super();
		this.потужністьдвигуна = потужністьдвигуна;
		this.кількістьмісць = кількістьмісць;
		this.колесо = колесо;
		this.кермо = кермо;
		this.кузов = кузов;
	}

	public int getПотужністьдвигуна() {
		return потужністьдвигуна;
	}

	public void setПотужністьдвигуна(int потужністьдвигуна) {
		this.потужністьдвигуна = потужністьдвигуна;
	}

	public int getКількістьмісць() {
		return кількістьмісць;
	}

	public void setКількістьмісць(int кількістьмісць) {
		this.кількістьмісць = кількістьмісць;
	}

	public Колесо getКолесо() {
		return колесо;
	}

	public void setКолесо(Колесо колесо) {
		this.колесо = колесо;
	}

	public Кермо getКермо() {
		return кермо;
	}

	public void setКермо(Кермо кермо) {
		this.кермо = кермо;
	}

	public Кузов getКузов() {
		return кузов;
	}

	public void setКузов(Кузов кузов) {
		this.кузов = кузов;
	}

	@Override
	public String toString() {
		return "Машина [потужністьдвигуна=" + потужністьдвигуна + ", кількістьмісць=" + кількістьмісць + ", колесо="
				+ колесо + ", кермо=" + кермо + ", кузов=" + кузов + "]";
	}
	
	
	
	
}